<?php

use Illuminate\Database\Seeder;

class SetteingsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('pages')->insert([
            'id'            => '1',
            'header'        => 'مرحبا بكم في موقعنا',
            'description'   => 'تعريف بالموقع تعريف بالموقع تعريف بالموقع تعريف بالموقع  تعريف بالموقع تعريف بالموقع  تعريف بالموقع تعريف بالموقع  تعريف بالموقع تعريف بالموقع  تعريف بالموقع تعريف بالموقع  تعريف بالموقع تعريف بالموقع  تعريف بالموقع تعريف بالموقع  تعريف بالموقع تعريف بالموقع  تعريف بالموقع تعريف بالموقع  تعريف بالموقع تعريف بالموقع  تعريف بالموقع تعريف بالموقع  تعريف بالموقع تعريف بالموقع  تعريف بالموقع تعريف بالموقع  تعريف بالموقع تعريف بالموقع  تعريف بالموقع تعريف بالموقع  تعريف بالموقع تعريف بالموقع  تعريف بالموقع تعريف بالموقع',
            'section2'      =>  'شروط واحكام',
            'description2'  =>  'شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  شروط واحكام  ',
            'section3'      =>  'سياسة الاستخدام',
            'description3'  =>  'سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  سياسة الاستخدام  '
        ]);

        DB::table('settings')->insert([
            'id'            =>  '1',
            'phone1'        =>  '0',
            'phone2'        =>  '0',
            'location'      =>  'location',
            'facebook'      =>  'www.facebook.com',
            'twitter'       =>  'www.twitter.com',
            'instegram'     =>  'www.instegram.com',
            'description'   =>  'some description',
        ]);

    }
}
